Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidInsulationSpecificationWarning Property
 The insulation specification is invalid for the pinned fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartInvalidInsulationSpecificationWarning { get; }
Public Shared ReadOnly Property FabricationPartInvalidInsulationSpecificationWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartInvalidInsulationSpecificationWarning {
	FailureDefinitionId^ get ();
}
static member FabricationPartInvalidInsulationSpecificationWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace